Tekla.Structures.ModelInternal.ModelExtensions
DO NOT USE! For internal usage only!
The Tekla.Structures.ModelInternal.ModelExtensions class provides a set of extension methods for the Tekla.Structures.Model.Model type.
Remarks:
Used by the DM platform adapter.

Tekla.Structures.ModelInternal.ModelExtensions.GetModelObjectType(Tekla.Structures.Model.Model,Tekla.Structures.Identifier)
Gets the System.Type of the Tekla.Structures.Model.ModelObject identified by the given ID.
Model: The Tekla.Structures.Model.Model to get the model object identified by ID from.
ID: The identifier of the model object of which its System.Type needs to be returned.
Returns: The System.Type of the Tekla.Structures.Model.ModelObject identified by the given ID.

Tekla.Structures.ModelInternal.ModelExtensions.TryGetModelObjectType(Tekla.Structures.Model.Model,Tekla.Structures.Identifier,System.Type@)
Tries to get the System.Type of the Tekla.Structures.Model.ModelObject identified by the given ID, if any.
Model: The Tekla.Structures.Model.Model to get the model object identified by ID from.
ID: The identifier of the model object of which its System.Type needs to be returned.
ObjectType: The System.Type of the Tekla.Structures.Model.ModelObject identified by the given ID, if any.
Returns: True if a System.Type can be resolved for the model object; otherwise, false.